OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1618.h
#define PID1K20                 PID1K2Lbits.PID1K20             // bit 0, shadows bit in PID1K2Lbits
#define K20                     PID1K2Lbits.K20                 // bit 0, shadows bit in PID1K2Lbits
#define PID1K21                 PID1K2Lbits.PID1K21             // bit 1, shadows bit in PID1K2Lbits
#define K21                     PID1K2Lbits.K21                 // bit 1, shadows bit in PID1K2Lbits
#define PID1K22                 PID1K2Lbits.PID1K22             // bit 2, shadows bit in PID1K2Lbits
#define K22                     PID1K2Lbits.K22                 // bit 2, shadows bit in PID1K2Lbits
#define PID1K23                 PID1K2Lbits.PID1K23             // bit 3, shadows bit in PID1K2Lbits
#define K23                     PID1K2Lbits.K23                 // bit 3, shadows bit in PID1K2Lbits
#define PID1K24                 PID1K2Lbits.PID1K24             // bit 4, shadows bit in PID1K2Lbits
#define K24                     PID1K2Lbits.K24                 // bit 4, shadows bit in PID1K2Lbits
#define PID1K25                 PID1K2Lbits.PID1K25             // bit 5, shadows bit in PID1K2Lbits
#define K25                     PID1K2Lbits.K25                 // bit 5, shadows bit in PID1K2Lbits
#define PID1K26                 PID1K2Lbits.PID1K26             // bit 6, shadows bit in PID1K2Lbits
#define K26                     PID1K2Lbits.K26                 // bit 6, shadows bit in PID1K2Lbits
#define PID1K27                 PID1K2Lbits.PID1K27             // bit 7, shadows bit in PID1K2Lbits
#define K27                     PID1K2Lbits.K27                 // bit 7, shadows bit in PID1K2Lbits

#define PID1K38                 PID1K3Hbits.PID1K38             // bit 0, shadows bit in PID1K3Hbits
#define K38                     PID1K3Hbits.K38                 // bit 0, shadows bit in PID1K3Hbits
#define PID1K39                 PID1K3Hbits.PID1K39             // bit 1, shadows bit in PID1K3Hbits
#define K39                     PID1K3Hbits.K39                 // bit 1, shadows bit in PID1K3Hbits
#define PID1K310                PID1K3Hbits.PID1K310            // bit 2, shadows bit in PID1K3Hbits
#define K310                    PID1K3Hbits.K310                // bit 2, shadows bit in PID1K3Hbits
#define PID1K311                PID1K3Hbits.PID1K311            // bit 3, shadows bit in PID1K3Hbits
#define K311                    PID1K3Hbits.K311                // bit 3, shadows bit in PID1K3Hbits
#define PID1K312                PID1K3Hbits.PID1K312            // bit 4, shadows bit in PID1K3Hbits
#define K312                    PID1K3Hbits.K312                // bit 4, shadows bit in PID1K3Hbits
#define PID1K313                PID1K3Hbits.PID1K313            // bit 5, shadows bit in PID1K3Hbits
#define K313                    PID1K3Hbits.K313                // bit 5, shadows bit in PID1K3Hbits
#define PID1K314                PID1K3Hbits.PID1K314            // bit 6, shadows bit in PID1K3Hbits
#define K314                    PID1K3Hbits.K314                // bit 6, shadows bit in PID1K3Hbits
#define PID1K315                PID1K3Hbits.PID1K315            // bit 7, shadows bit in PID1K3Hbits
#define K315                    PID1K3Hbits.K315                // bit 7, shadows bit in PID1K3Hbits

#define PID1K30                 PID1K3Lbits.PID1K30             // bit 0, shadows bit in PID1K3Lbits
#define K30                     PID1K3Lbits.K30                 // bit 0, shadows bit in PID1K3Lbits
#define PID1K31                 PID1K3Lbits.PID1K31             // bit 1, shadows bit in PID1K3Lbits
#define K31                     PID1K3Lbits.K31                 // bit 1, shadows bit in PID1K3Lbits
#define PID1K32                 PID1K3Lbits.PID1K32             // bit 2, shadows bit in PID1K3Lbits
#define K32                     PID1K3Lbits.K32                 // bit 2, shadows bit in PID1K3Lbits
#define PID1K33                 PID1K3Lbits.PID1K33             // bit 3, shadows bit in PID1K3Lbits
#define K33                     PID1K3Lbits.K33                 // bit 3, shadows bit in PID1K3Lbits
#define PID1K34                 PID1K3Lbits.PID1K34             // bit 4, shadows bit in PID1K3Lbits
#define K34                     PID1K3Lbits.K34                 // bit 4, shadows bit in PID1K3Lbits
#define PID1K35                 PID1K3Lbits.PID1K35             // bit 5, shadows bit in PID1K3Lbits
#define K35                     PID1K3Lbits.K35                 // bit 5, shadows bit in PID1K3Lbits
#define PID1K36                 PID1K3Lbits.PID1K36             // bit 6, shadows bit in PID1K3Lbits
#define K36                     PID1K3Lbits.K36                 // bit 6, shadows bit in PID1K3Lbits
#define PID1K37                 PID1K3Lbits.PID1K37             // bit 7, shadows bit in PID1K3Lbits
#define K37                     PID1K3Lbits.K37                 // bit 7, shadows bit in PID1K3Lbits

#define PID1OUT24               PID1OUTHHbits.PID1OUT24         // bit 0, shadows bit in PID1OUTHHbits
#define OUT24                   PID1OUTHHbits.OUT24             // bit 0, shadows bit in PID1OUTHHbits
#define PID1OUT25               PID1OUTHHbits.PID1OUT25         // bit 1, shadows bit in PID1OUTHHbits
#define OUT25                   PID1OUTHHbits.OUT25             // bit 1, shadows bit in PID1OUTHHbits
#define PID1OUT26               PID1OUTHHbits.PID1OUT26         // bit 2, shadows bit in PID1OUTHHbits
#define OUT26                   PID1OUTHHbits.OUT26             // bit 2, shadows bit in PID1OUTHHbits
#define PID1OUT27               PID1OUTHHbits.PID1OUT27         // bit 3, shadows bit in PID1OUTHHbits
#define OUT27                   PID1OUTHHbits.OUT27             // bit 3, shadows bit in PID1OUTHHbits
#define PID1OUT28               PID1OUTHHbits.PID1OUT28         // bit 4, shadows bit in PID1OUTHHbits
#define OUT28                   PID1OUTHHbits.OUT28             // bit 4, shadows bit in PID1OUTHHbits
#define PID1OUT29               PID1OUTHHbits.PID1OUT29         // bit 5, shadows bit in PID1OUTHHbits
#define OUT29                   PID1OUTHHbits.OUT29             // bit 5, shadows bit in PID1OUTHHbits
#define PID1OUT30               PID1OUTHHbits.PID1OUT30         // bit 6, shadows bit in PID1OUTHHbits
#define OUT30                   PID1OUTHHbits.OUT30             // bit 6, shadows bit in PID1OUTHHbits
#define PID1OUT31               PID1OUTHHbits.PID1OUT31         // bit 7, shadows bit in PID1OUTHHbits
#define OUT31                   PID1OUTHHbits.OUT31             // bit 7, shadows bit in PID1OUTHHbits

#define PID1OUT16               PID1OUTHLbits.PID1OUT16         // bit 0, shadows bit in PID1OUTHLbits
#define OUT16                   PID1OUTHLbits.OUT16             // bit 0, shadows bit in PID1OUTHLbits
#define PID1OUT17               PID1OUTHLbits.PID1OUT17         // bit 1, shadows bit in PID1OUTHLbits
#define OUT17                   PID1OUTHLbits.OUT17             // bit 1, shadows bit in PID1OUTHLbits
#define PID1OUT18               PID1OUTHLbits.PID1OUT18         // bit 2, shadows bit in PID1OUTHLbits
#define OUT18                   PID1OUTHLbits.OUT18             // bit 2, shadows bit in PID1OUTHLbits
#define PID1OUT19               PID1OUTHLbits.PID1OUT19         // bit 3, shadows bit in PID1OUTHLbits
#define OUT19                   PID1OUTHLbits.OUT19             // bit 3, shadows bit in PID1OUTHLbits
#define PID1OUT20               PID1OUTHLbits.PID1OUT20         // bit 4, shadows bit in PID1OUTHLbits
#define OUT20                   PID1OUTHLbits.OUT20             // bit 4, shadows bit in PID1OUTHLbits
#define PID1OUT21               PID1OUTHLbits.PID1OUT21         // bit 5, shadows bit in PID1OUTHLbits
#define OUT21                   PID1OUTHLbits.OUT21             // bit 5, shadows bit in PID1OUTHLbits
#define PID1OUT22               PID1OUTHLbits.PID1OUT22         // bit 6, shadows bit in PID1OUTHLbits
#define OUT22                   PID1OUTHLbits.OUT22             // bit 6, shadows bit in PID1OUTHLbits
#define PID1OUT23               PID1OUTHLbits.PID1OUT23         // bit 7, shadows bit in PID1OUTHLbits
#define OUT23                   PID1OUTHLbits.OUT23             // bit 7, shadows bit in PID1OUTHLbits

#define PID1OUT8                PID1OUTLHbits.PID1OUT8          // bit 0, shadows bit in PID1OUTLHbits
#define OUT8                    PID1OUTLHbits.OUT8              // bit 0, shadows bit in PID1OUTLHbits
#define PID1OUT9                PID1OUTLHbits.PID1OUT9          // bit 1, shadows bit in PID1OUTLHbits
#define OUT9                    PID1OUTLHbits.OUT9              // bit 1, shadows bit in PID1OUTLHbits
#define PID1OUT10               PID1OUTLHbits.PID1OUT10         // bit 2, shadows bit in PID1OUTLHbits
#define OUT10                   PID1OUTLHbits.OUT10             // bit 2, shadows bit in PID1OUTLHbits
#define PID1OUT11               PID1OUTLHbits.PID1OUT11         // bit 3, shadows bit in PID1OUTLHbits
#define OUT11                   PID1OUTLHbits.OUT11             // bit 3, shadows bit in PID1OUTLHbits
#define PID1OUT12               PID1OUTLHbits.PID1OUT12         // bit 4, shadows bit in PID1OUTLHbits
#define OUT12                   PID1OUTLHbits.OUT12             // bit 4, shadows bit in PID1OUTLHbits
#define PID1OUT13               PID1OUTLHbits.PID1OUT13         // bit 5, shadows bit in PID1OUTLHbits
#define OUT13                   PID1OUTLHbits.OUT13             // bit 5, shadows bit in PID1OUTLHbits
#define PID1OUT14               PID1OUTLHbits.PID1OUT14         // bit 6, shadows bit in PID1OUTLHbits
#define OUT14                   PID1OUTLHbits.OUT14             // bit 6, shadows bit in PID1OUTLHbits
#define PID1OUT15               PID1OUTLHbits.PID1OUT15         // bit 7, shadows bit in PID1OUTLHbits
#define OUT15                   PID1OUTLHbits.OUT15             // bit 7, shadows bit in PID1OUTLHbits

#define PID1OUT0                PID1OUTLLbits.PID1OUT0          // bit 0, shadows bit in PID1OUTLLbits
#define OUT0                    PID1OUTLLbits.OUT0              // bit 0, shadows bit in PID1OUTLLbits
#define PID1OUT1                PID1OUTLLbits.PID1OUT1          // bit 1, shadows bit in PID1OUTLLbits
#define OUT1                    PID1OUTLLbits.OUT1              // bit 1, shadows bit in PID1OUTLLbits
#define PID1OUT2                PID1OUTLLbits.PID1OUT2          // bit 2, shadows bit in PID1OUTLLbits
#define OUT2                    PID1OUTLLbits.OUT2              // bit 2, shadows bit in PID1OUTLLbits
#define PID1OUT3                PID1OUTLLbits.PID1OUT3          // bit 3, shadows bit in PID1OUTLLbits
#define OUT3                    PID1OUTLLbits.OUT3              // bit 3, shadows bit in PID1OUTLLbits
#define PID1OUT4                PID1OUTLLbits.PID1OUT4          // bit 4, shadows bit in PID1OUTLLbits
#define OUT4                    PID1OUTLLbits.OUT4              // bit 4, shadows bit in PID1OUTLLbits
#define PID1OUT5                PID1OUTLLbits.PID1OUT5          // bit 5, shadows bit in PID1OUTLLbits
#define OUT5                    PID1OUTLLbits.OUT5              // bit 5, shadows bit in PID1OUTLLbits
#define PID1OUT6                PID1OUTLLbits.PID1OUT6          // bit 6, shadows bit in PID1OUTLLbits
#define OUT6                    PID1OUTLLbits.OUT6              // bit 6, shadows bit in PID1OUTLLbits
#define PID1OUT7                PID1OUTLLbits.PID1OUT7          // bit 7, shadows bit in PID1OUTLLbits
#define OUT7                    PID1OUTLLbits.OUT7              // bit 7, shadows bit in PID1OUTLLbits

#define PID1OUT32               PID1OUTUbits.PID1OUT32          // bit 0, shadows bit in PID1OUTUbits
#define OUT32                   PID1OUTUbits.OUT32              // bit 0, shadows bit in PID1OUTUbits
#define PID1OUT33               PID1OUTUbits.PID1OUT33          // bit 1, shadows bit in PID1OUTUbits
#define OUT33                   PID1OUTUbits.OUT33              // bit 1, shadows bit in PID1OUTUbits
#define PID1OUT34               PID1OUTUbits.PID1OUT34          // bit 2, shadows bit in PID1OUTUbits
#define OUT34                   PID1OUTUbits.OUT34              // bit 2, shadows bit in PID1OUTUbits
#define PID1OUT35               PID1OUTUbits.PID1OUT35          // bit 3, shadows bit in PID1OUTUbits
#define OUT35                   PID1OUTUbits.OUT35              // bit 3, shadows bit in PID1OUTUbits

#define PID1SET8                PID1SETHbits.PID1SET8           // bit 0, shadows bit in PID1SETHbits
#define SET8                    PID1SETHbits.SET8               // bit 0, shadows bit in PID1SETHbits
#define PID1SET9                PID1SETHbits.PID1SET9           // bit 1, shadows bit in PID1SETHbits
#define SET9                    PID1SETHbits.SET9               // bit 1, shadows bit in PID1SETHbits
#define PID1SET10               PID1SETHbits.PID1SET10          // bit 2, shadows bit in PID1SETHbits
#define SET10                   PID1SETHbits.SET10              // bit 2, shadows bit in PID1SETHbits
#define PID1SET11               PID1SETHbits.PID1SET11          // bit 3, shadows bit in PID1SETHbits
#define SET11                   PID1SETHbits.SET11              // bit 3, shadows bit in PID1SETHbits
#define PID1SET12               PID1SETHbits.PID1SET12          // bit 4, shadows bit in PID1SETHbits
#define SET12                   PID1SETHbits.SET12              // bit 4, shadows bit in PID1SETHbits
#define PID1SET13               PID1SETHbits.PID1SET13          // bit 5, shadows bit in PID1SETHbits
#define SET13                   PID1SETHbits.SET13              // bit 5, shadows bit in PID1SETHbits
#define PID1SET14               PID1SETHbits.PID1SET14          // bit 6, shadows bit in PID1SETHbits
#define SET14                   PID1SETHbits.SET14              // bit 6, shadows bit in PID1SETHbits
#define PID1SET15               PID1SETHbits.PID1SET15          // bit 7, shadows bit in PID1SETHbits
#define SET15                   PID1SETHbits.SET15              // bit 7, shadows bit in PID1SETHbits

#define PID1SET0                PID1SETLbits.PID1SET0           // bit 0, shadows bit in PID1SETLbits
#define SET0                    PID1SETLbits.SET0               // bit 0, shadows bit in PID1SETLbits
#define PID1SET1                PID1SETLbits.PID1SET1           // bit 1, shadows bit in PID1SETLbits
#define SET1                    PID1SETLbits.SET1               // bit 1, shadows bit in PID1SETLbits
#define PID1SET2                PID1SETLbits.PID1SET2           // bit 2, shadows bit in PID1SETLbits
#define SET2                    PID1SETLbits.SET2               // bit 2, shadows bit in PID1SETLbits
#define PID1SET3                PID1SETLbits.PID1SET3           // bit 3, shadows bit in PID1SETLbits
#define SET3                    PID1SETLbits.SET3               // bit 3, shadows bit in PID1SETLbits
#define PID1SET4                PID1SETLbits.PID1SET4           // bit 4, shadows bit in PID1SETLbits
#define SET4                    PID1SETLbits.SET4               // bit 4, shadows bit in PID1SETLbits
#define PID1SET5                PID1SETLbits.PID1SET5           // bit 5, shadows bit in PID1SETLbits
#define SET5                    PID1SETLbits.SET5               // bit 5, shadows bit in PID1SETLbits
#define PID1SET6                PID1SETLbits.PID1SET6           // bit 6, shadows bit in PID1SETLbits
#define SET6                    PID1SETLbits.SET6               // bit 6, shadows bit in PID1SETLbits
#define PID1SET7                PID1SETLbits.PID1SET7           // bit 7, shadows bit in PID1SETLbits
#define SET7                    PID1SETLbits.SET7               // bit 7, shadows bit in PID1SETLbits

